test/box100x100/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1912;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0.0 0.0 0.0);

boundaryField
{
    "(inlet|bottom)"
    {
        type            fixedValue;
        value           $internalField;
    }

    "(top|outlet)"
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    "(sym|back)"
    {
        type            slip;
    }

    "(wing|tail)"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
