test/box100x100/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default          Gauss linear;
 //   div(phi,U)      bounded Gauss linearUpwindV grad(U);
 //   div(phi,k)      bounded Gauss upwind;
 //   div(phirho,k)      bounded Gauss upwind;
//    div(phi,omega)  bounded Gauss upwind;
//    div(phiRhof,omega) bounded Gauss upwind;
//    div(phiRhof,k) bounded Gauss upwind;
//    div((nuEff*dev(T(grad(U))))) Gauss linear;

//    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
//    div(phi,e)      bounded Gauss upwind;
//    div(phi,epsilon) bounded Gauss upwind;
//    div(phirho,epsilon) bounded Gauss upwind;
//    div(phi,Ekp)    bounded Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
}

fvsc
{
    default    GaussVolPoint;
}

wallDist
{
    method meshWave;
}
// ************************************************************************* //
